[
    {
        "id": "prolog_1",
        "backgroundImage": "assets/bg/class.jpg",
        "characterImage": "assets/images/character_ava_neutral.png",
        "dialog": "(Suara tawa anak-anak terdengar samar)",
        "nextScene": "prolog_2"
        
    },
    {
        "id": "prolog_2",
        "dialog": "(Suara Zia Dewasa):\nDulu, duniaku penuh warna. Kanvas putih adalah sahabatku, dan kuas adalah caraku berbicara...",
        "nextScene": "prolog_3"
    },
    {
        "id": "prolog_3",
        "dialog": "(Gambar berubah menjadi lebih jelas: Zia kecil sedang melukis di taman, Aira kecil memperhatikannya dari kejauhan...)",
        "nextScene": "prolog_4"
    },
    {
        "id": "prolog_4",
        "dialog": "(Suara Zia Dewasa)\nAku juga ingat... ada sepasang mata yang selalu menatapku dengan kagum...",
        "nextScene": "prolog_5"
    },
    {
        "id": "prolog_5",
        "dialog": "(Gambar tiba-tiba robek. Suara tawa berubah menjadi suara cemoohan dan tangisan. Gambar menjadi hitam.)",
        "nextScene": "prolog_6"
    },
    {
        "id": "prolog_6",
        "dialog": "(Suara Zia Dewasa)\nNamun, satu hari yang kelam merenggut semua warna itu... Sejak saat itu, aku bersumpah untuk tidak akan pernah menyentuh kuas lagi...",
        "nextScene": "prolog_7"
    },
    {
        "id": "prolog_7",
        "dialog": "(Layar menampilkan Zia dewasa, duduk di kamarnya yang monoton, menatap keluar jendela.)",
        "nextScene": "prolog_8"
    },
    {
        "id": "prolog_8",
        "dialog": "(Suara Zia Dewasa):\nDan aku baik-baik saja dengan itu. Atau... setidaknya, begitulah yang kukatakan pada diriku sendiri.",
        "nextScene": "adegan1_1"
    },
    {
        "id": "adegan1_1",
        "dialog": "(Taman kampus. Zia sedang duduk sendiri, melamun. Tiba-tiba Aira duduk di sebelahnya dengan senyum lebar.)",
        "nextScene": "adegan1_2"
    },
    {
        "id": "adegan1_2",
        "dialog": "Aira: \"Permisi, kamu Zia, kan? Si pelukis cilik dari komplek Bekasi!\"",
        "nextScene": "adegan1_choice1"
    },
    {
        "id": "adegan1_choice1",
        "dialog": "(Zia menoleh, kaget karena seseorang mengingat masa lalunya. Bagaimana ia harus merespon?)",
        "choices": [
            { "label": "\"Salah orang.\"", "nextScene": "adegan1_path_A" },
            { "label": "\"...Mungkin. Aku tidak ingat.\"", "nextScene": "adegan1_path_B" }
        ]
    },
    {
        "id": "adegan1_path_A",
        "dialog": "Zia: (Menjawab dengan dingin) \"Salah orang.\"",
        "nextScene": "adegan1_merge"
    },
    {
        "id": "adegan1_path_B",
        "dialog": "Zia: (Menjawab dengan ragu) \"...Mungkin. Aku tidak ingat.\"",
        "nextScene": "adegan1_merge"
    },
    {
        "id": "adegan1_merge",
        "dialog": "Aira: \"Eh? Masa sih? Aku yakin sekali. Dulu kamu suka melukis di taman, dan lukisanmu bagus sekali! Aku Aira, kita dulu tetanggaan.\"",
        "nextScene": "adegan1_5"
    },
    {
        "id": "adegan1_5",
        "dialog": "Zia: (Berdiri, hendak pergi) \"Aku sudah tidak melukis. Permisi.\"",
        "nextScene": "adegan1_6"
    },
    {
        "id": "adegan1_6",
        "dialog": "Aira: (Menahan lengannya, tatapannya tulus) \"Tunggu! Kenapa berhenti? Padahal... aku selalu suka melihatmu melukis.\"",
        "nextScene": "adegan1_7"
    },
    {
        "id": "adegan1_7",
        "dialog": "(Zia terdiam sejenak, tatapannya sedikit goyah, lalu menarik lengannya dan pergi tanpa berkata apa-apa.)",
        "nextScene": "adegan2_1"
    },
    {
        "id": "adegan2_1",
        "dialog": "(Di depan toko peralatan seni. Aira berhasil \"menyeret\" Zia ke sana.)",
        "nextScene": "adegan2_2"
    },
    {
        "id": "adegan2_2",
        "dialog": "Aira: \"Ayolah, Zia! Lihat! Cat akrilik ini warnanya cerah sekali! Pasti bagus untuk melukis langit senja.\"",
        "nextScene": "adegan2_choice2"
    },
    {
        "id": "adegan2_choice2",
        "dialog": "(Zia menatap cat yang ditawarkan Aira. Rasa sakit dari masa lalu kembali terasa.)",
        "choices": [
            { "label": "\"Untuk apa? Sudah kubilang aku berhenti.\"", "nextScene": "adegan2_path_A" },
            { "label": "\"Jangan memaksaku, Aira.\"", "nextScene": "adegan2_path_B" }
        ]
    },
    {
        "id": "adegan2_path_A",
        "dialog": "Zia: \"Untuk apa? Sudah kubilang aku berhenti.\"",
        "nextScene": "adegan2_merge"
    },
    {
        "id": "adegan2_path_B",
        "dialog": "Zia: (Dengan nada lelah) \"Jangan memaksaku, Aira.\"",
        "nextScene": "adegan2_merge"
    },
    {
        "id": "adegan2_merge",
        "dialog": "Aira: \"Kenapa? Karena dulu ada yang mengejek lukisanmu di lomba itu?\"",
        "nextScene": "adegan2_5"
    },
    {
        "id": "adegan2_5",
        "dialog": "Zia: (Terkejut) \"Bagaimana kamu tahu?\"",
        "nextScene": "adegan2_6"
    },
    {
        "id": "adegan2_6",
        "dialog": "Aira: \"Aku ada di sana. Aku melihatmu menangis. Tapi aku juga melihat betapa indahnya lukisanmu... Mereka tidak mengerti seni, Zia.\"",
        "nextScene": "adegan2_7"
    },
    {
        "id": "adegan2_7",
        "dialog": "Zia: (Menunduk, suaranya pelan) \"Tetap saja... itu menyakitkan.\"",
        "nextScene": "adegan2_8"
    },
    {
        "id": "adegan2_8",
        "dialog": "Aira: (Menyodorkan kuas) \"Kalau begitu, melukislah untuk dirimu sendiri. Atau... melukislah untukku. Aku ingin melihat duniamu yang penuh warna lagi.\"",
        "nextScene": "adegan2_9"
    },
    {
        "id": "adegan2_9",
        "dialog": "(Zia menatap kuas di tangannya, lalu menatap Aira. Untuk pertama kalinya, ada keraguan dalam keputusannya untuk berhenti.)",
        "nextScene": "adegan3_1"
    },
    {
        "id": "adegan3_1",
        "dialog": "(Di tepi danau kampus saat matahari terbenam. Zia merasa inilah saat yang tepat.)",
        "nextScene": "adegan3_2"
    },
    {
        "id": "adegan3_2",
        "dialog": "Zia: \"Aira... selama ini aku merasa duniaku gelap. Tapi sejak bertemu denganmu, semuanya jadi berbeda. Kamu membawa warna dalam hidupku lagi.\"",
        "nextScene": "adegan3_3"
    },
    {
        "id": "adegan3_3",
        "dialog": "(Aira menatap air danau, wajahnya sulit dibaca. Dia baru saja kembali dari rumah sakit.)",
        "nextScene": "adegan3_choice3"
    },
    {
        "id": "adegan3_choice3",
        "dialog": "(Zia mengumpulkan seluruh keberaniannya.)",
        "choices": [
            { "label": "(Nyatakan perasaanmu sekarang)", "nextScene": "adegan3_merge" },
            { "label": "(Mungkin lain kali saja...)", "nextScene": "adegan3_path_hesitate" }
        ]
    },
    {
        "id": "adegan3_path_hesitate",
        "dialog": "(Zia ragu. Tapi melihat wajah Aira, ia tahu ia harus mengatakannya sekarang juga.)",
        "nextScene": "adegan3_merge"
    },
    {
        "id": "adegan3_merge",
        "dialog": "Zia: \"Aku... aku rasa aku jatuh cinta padamu, Aira. Maukah kamu...\"",
        "nextScene": "adegan3_5"
    },
    {
        "id": "adegan3_5",
        "dialog": "Aira: (Memotong dengan nada dingin, tanpa menoleh) \"Hentikan, Zia.\"",
        "nextScene": "adegan3_6"
    },
    {
        "id": "adegan3_6",
        "dialog": "Zia: \"A-apa?\"",
        "nextScene": "adegan3_7"
    },
    {
        "id": "adegan3_7",
        "dialog": "Aira: (Berbalik, menatap Zia dengan tatapan kosong) \"Aku sadar kita tidak cocok. Aku lelah harus terus menyemangatimu. Maaf, ini tidak akan berhasil.\"",
        "nextScene": "adegan3_8"
    },
    {
        "id": "adegan3_8",
        "dialog": "Zia: (Terpukul, tidak percaya) \"Tapi... kemarin... kita baik-baik saja. Apa maksudmu?\"",
        "nextScene": "adegan3_9"
    },
    {
        "id": "adegan3_9",
        "dialog": "Aira: \"Aku hanya bosan. Tolong, jangan temui aku lagi.\"",
        "nextScene": "adegan3_10"
    },
    {
        "id": "adegan3_10",
        "dialog": "(Aira berjalan pergi meninggalkan Zia yang membeku, hatinya hancur berkeping-keping...)",
        "nextScene": "epilog_1"
    },
    {
        "id": "epilog_1",
        "dialog": "(Beberapa hari kemudian, di tepi danau yang sama, ibu Aira menghampiri Zia...)",
        "nextScene": "epilog_2"
    },
    {
        "id": "epilog_2",
        "dialog": "Ibu Aira: Apakah kamu dek Zia?",
        "nextScene": "epilog_3"
    },
    {
        "id": "epilog_3",
        "dialog": "Zia: i-iya bu, Apakah ada yang perlu di bantu bu?",
        "nextScene": "epilog_4"
    },
    {
        "id": "epilog_4",
        "dialog": "Ibu Aira: Ah Bagus lah kalo begitu, tidak ibu hanya ingin memberikan surat ini untuk dek Zia.",
        "nextScene": "epilog_5"
    },
    {
        "id": "epilog_5",
        "dialog": "Ibu Aira: Ternyata Aira benar kamu akan benar-benar berada di sini",
        "nextScene": "epilog_6"
    },
    {
        "id": "epilog_6",
        "dialog": "Zia: Aira?, apakah ibu adalah ibunya Aira?, lalu dimana Aira bu?, aku ingin bertemu dengannya sekali lagi",
        "nextScene": "epilog_7"
    },
    {
        "id": "epilog_7",
        "dialog": "(Ibu Aira hanya menundukan kepalanya dan menahan tangisnya sambil memberikan surat itu ke Zia)",
        "nextScene": "epilog_8"
    },
    {
        "id": "epilog_8",
        "dialog": "Zia: Bu ada apa bu ibu kenapa menangis, lalu surat apa ini bu?",
        "nextScene": "epilog_9"
    },
    {
        "id": "epilog_9",
        "dialog": "Ibu Aira: Biar surat ini yang menjelaskan semuanya dek Zia (Dengan nafas yang terisak-isak)",
        "nextScene": "epilog_10"
    },
    {
        "id": "epilog_10",
        "dialog": "(Zia membuka surat itu dengan tergesa-gesa, dan dengan perasaan yang berantakan)",
        "nextScene": "epilog_11"
    },
    {
        "id": "epilog_11",
        "dialog": "(Zia membaca surat dari Aira yang menjelaskan segalanya... tentang penyakitnya, perasaannya yang tulus, dan alasannya menolak Zia.)",
        "nextScene": "epilog_12"
    },
    {
                "id": "epilog_12",
        "dialog": "(Aira:\nUntuk Zia-ku yang tersayang,\n\nJika kamu membaca surat ini, artinya aku sudah tidak ada di dunia ini lagi. Maaf, ya. Aku tidak pandai berpamitan.\n\nKamu mungkin tidak ingat, tapi aku sudah mengenalmu sejak lama. Aku adalah gadis kecil yang selalu bersembunyi di balik pohon, mengagumi setiap goresan kuasmu di taman. Bagiku, kamu adalah penyihir yang bisa menciptakan keajaiban di atas kanvas. Lukisanmu adalah duniaku.\n\nBertemu denganmu lagi di kampus adalah sebuah keajaiban. Sejujurnya, saat itu dokter bilang waktuku sudah tidak banyak. Tapi melihatmu lagi, meskipun kamu terlihat muram, memberiku kekuatan untuk bertahan lebih lama. Aku ingin melihatmu tersenyum. Aku ingin melihatmu melukis lagi. Itu menjadi tujuanku, alasanku untuk bangun setiap pagi.\n\nSetiap candaan, setiap perhatian yang kuberikan, semuanya tulus dari hatiku. Aku benar-benar jatuh cinta padamu, Zia.\n\nLalu, hari itu tiba. Saat dokter berkata waktuku hanya tersisa 24 jam. Di saat yang bersamaan, kamu datang dengan tatapan penuh cinta itu. Hatiku hancur, Zia. Bagaimana mungkin aku membiarkanmu masuk lebih dalam, hanya untuk meninggalkanmu sendirian?\n\nAku memilih menjadi pengecut. Aku menyakitimu. Aku mendorongmu menjauh karena aku pikir... mungkin jika kamu membenciku, rasa sakit saat aku pergi tidak akan terlalu dalam. Maafkan aku. Aku sangat bodoh dan egois.\n\nAku tidak ingin kamu bersedih terlalu lama karenaku. Aku ingin kamu bahagia. Kembali melukis ya? Warnai duniamu lagi, seperti yang dulu kamu lakukan.\n\nDan satu permintaan terakhirku...\n\nTolong, jangan membenciku. Ingatlah aku sebagai Aira yang usil, yang selalu mengagumi lukisanmu, dan yang akan selalu mencintaimu, bahkan dari tempat yang berbeda.\n\nSelalu milikmu,\nAira.\n)",
        "nextScene": "epilog_13"

    },
    {
        "id": "epilog_13",
        "dialog": "(Zia: Surat itu terlepas dari genggamanku. Air mata yang selama ini kutahan akhirnya tumpah. Bukan karena benci, tapi karena penyesalan.)",
        "nextScene": "epilog_14"
    },
    {
        "id": "epilog_14",
        "dialog": "(Zia berlari menembus hujan, seolah langit pun ikut menangis. Setiap kata dalam surat itu bergema di kepalanya. Bodoh. Akulah yang bodoh karena tidak menyadarinya.)",
        "nextScene": "epilog_15"
    },
    {
        "id": "epilog_15",
        "dialog": "(Zia tiba di pemakaman. Dia melihat gundukan tanah yang masih basah dengan sebuah nisan sederhana bertuliskan \"Aira\".)",
        "nextScene": "epilog_16"
    },
    {
        "id": "epilog_16",
        "dialog": "(Zia jatuh berlutut di depan makam itu. Isak tangisnya menjadi satu dengan suara hujan.)",
        "nextScene": "epilog_17"
    },
    {
        "id": "epilog_17",
        "dialog": "Zia: \"Maafkan aku... Aira... Maafkan aku...\" bisiknya di sela tangis. Di tengah rasa sakit, satu janji terucap dalam hati. Aku akan melukis lagi. Untuknya. Sebuah lukisan terakhir, yang paling indah, untuk cinta pertamaku yang abadi."
    }
]